app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'raunakgiri21@gmail.com'
 LIMIT 1
---
    public function signinPost()
    {
      $model = new UserModel();
      $email = $this->request->getVar('email');
      $password = $this->request->getVar('password');
      $result = $model->where('email',$email)->first();